Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK100.atdf
            <instance name="ICAP11">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="ICAP12">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="ICAP13">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="ICAP14">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="ICAP15">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="ICAP16">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02907" name="INT" version="">
            <instance name="INT">
               <register-group address-space="periph_pb1_fast" name="INT" name-in-module="INT" offset="0x1f810000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02869" name="JTAG" version="">
            <instance name="JTAG">
               <register-group address-space="periph_pb1_std" name="JTAG" name-in-module="JTAG" offset="0x1f801000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02819" name="NVM" version="">
            <instance name="NVM">
               <register-group address-space="periph_pb1_std" name="NVM" name-in-module="NVM" offset="0x1f800a00" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00749" name="OCMP" version="">
            <instance name="OCMP1">
               <register-group address-space="periph_pb2_std" name="OCMP" name-in-module="OCMP" offset="0x1f820000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="OCMP2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="OCMP3">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="OCMP4">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="OCMP5">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="OCMP6">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="OCMP7">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="OCMP8">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="OCMP9">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="OCMP10">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="OCMP11">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="OCMP12">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="OCMP13">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="OCMP14">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="OCMP15">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="OCMP16">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="03088" name="PCACHE" version="">
            <instance name="PCACHE">
               <register-group address-space="periph_pb1_std" name="PCACHE" name-in-module="PCACHE" offset="0x1f800800" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00751" name="PMP" version="">
            <instance name="PMP">
               <register-group address-space="periph_pb2_std" name="PMP" name-in-module="PMP" offset="0x1f82e000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01423" name="RPIN" version="">
            <instance name="RPIN">
               <register-group address-space="periph_pb1_std" name="RPIN" name-in-module="RPIN" offset="0x1f801404" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02481" name="RPOR" version="">
            <instance name="RPOR">
               <register-group address-space="periph_pb1_std" name="RPOR" name-in-module="RPOR" offset="0x1f801600" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01261" name="RTCC" version="">
            <instance name="RTCC">
               <register-group address-space="periph_pb6_std" name="RTCC" name-in-module="RTCC" offset="0x1f8c0000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00136" name="SB" version="">
            <instance name="SB">
               <register-group address-space="periph_ssx" name="SB" name-in-module="SB" offset="0x1f8f0510" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01329" name="SPI" version="">
            <instance name="SPI1">
               <register-group address-space="periph_pb2_std" name="SPI" name-in-module="SPI" offset="0x1f820000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="SPI2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="SPI3">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
