Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK100.atdf
      <value-group caption="Deadman Timer Count Select bits" name="DEVCFG1__DMTCNT">
         <value caption="2^8 (256)" name="DMT8" value="0x0" />
         <value caption="2^9 (512)" name="DMT9" value="0x1" />
         <value caption="2^10 (1024)" name="DMT10" value="0x2" />
         <value caption="2^11 (2048)" name="DMT11" value="0x3" />
         <value caption="2^12 (4096)" name="DMT12" value="0x4" />
         <value caption="2^13 (8192)" name="DMT13" value="0x5" />
         <value caption="2^14 (16384)" name="DMT14" value="0x6" />
         <value caption="2^15 (32768)" name="DMT15" value="0x7" />
         <value caption="2^16 (65536)" name="DMT16" value="0x8" />
         <value caption="2^17 (131072)" name="DMT17" value="0x9" />
         <value caption="2^18 (262144)" name="DMT18" value="0xa" />
         <value caption="2^19 (524288)" name="DMT19" value="0xb" />
         <value caption="2^20 (1048576)" name="DMT20" value="0xc" />
         <value caption="2^21 (2097152)" name="DMT21" value="0xd" />
         <value caption="2^22 (4194304)" name="DMT22" value="0xe" />
         <value caption="2^23 (8388608)" name="DMT23" value="0xf" />
         <value caption="2^24 (16777216)" name="DMT24" value="0x10" />
         <value caption="2^25 (33554432)" name="DMT25" value="0x11" />
         <value caption="2^26 (67108864)" name="DMT26" value="0x12" />
         <value caption="2^27 (134217728)" name="DMT27" value="0x13" />
         <value caption="2^28 (268435456)" name="DMT28" value="0x14" />
         <value caption="2^29 (536870912)" name="DMT29" value="0x15" />
         <value caption="2^30 (1073741824)" name="DMT30" value="0x16" />
         <value caption="2^31 (2147483648)" name="DMT31" value="0x17" />
      </value-group>
      <value-group caption="Deadman Timer enable bit" name="DEVCFG1__FDMTEN">
         <value caption="Deadman Timer is enabled and cannot be disabled by software" name="ON" value="0x1" />
         <value caption="Deadman Timer is disabled and can be enabled by software" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Background Debugger Enable bits" name="DEVCFG0__DEBUG">
         <value caption="Debugger is enabled" name="ON" value="0x0" />
         <value caption="Debugger is disabled" name="OFF" value="0x3" />
      </value-group>
      <value-group caption="JTAG Enable bit" name="DEVCFG0__JTAGEN">
         <value caption="JTAG Port Enabled" name="ON" value="0x1" />
         <value caption="JTAG Disabled" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="In-Circuit Emulator/Debugger Communication Channel Select bits" name="DEVCFG0__ICESEL">
         <value caption="Communicate on PGEC1/PGED1" name="ICS_PGx1" value="0x3" />
         <value caption="Communicate on PGEC2/PGED2" name="ICS_PGx2" value="0x2" />
         <value caption="Communicate on PGEC3/PGED3" name="ICS_PGx3" value="0x1" />
      </value-group>
      <value-group caption="Trace Enable bit" name="DEVCFG0__TRCEN">
         <value caption="Trace features in the CPU are enabled" name="ON" value="0x1" />
         <value caption="Trace features in the CPU are disabled" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Boot ISA Selection bit" name="DEVCFG0__BOOTISA">
         <value caption="Boot code and Exception code is MIPS32" name="MIPS32" value="0x1" />
         <value caption="Boot code and Exception code is microMIPS" name="MICROMIPS" value="0x0" />
      </value-group>
      <value-group caption="Dynamic Flash ECC Configuration bits" name="DEVCFG0__FECCCON">
         <value caption="ECC and Dynamic ECC are disabled (ECCCON(1-0) bits are writable)" name="ECC_DECC_DISABLE_ECCON_WRITABLE" value="0x3" />
         <value caption="ECC and Dynamic ECC are disabled (ECCCON(1-0) bits are locked)" name="ECC_DECC_DISABLE_ECCON_LOCKED" value="0x2" />
         <value caption="Dynamic Flash ECC is enabled (ECCCON(1-0) bits are locked)" name="DECC_ENABLE" value="0x1" />
         <value caption="Flash ECC is enabled (ECCCON(1-0) bits are locked; disables word Flash writes)" name="ECC_ENABLE" value="0x0" />
      </value-group>
      <value-group caption="Flash Sleep Mode bit" name="DEVCFG0__FSLEEP">
         <value caption="Flash power down is controlled by the VREGS bit" name="VREGS" value="0x0" />
         <value caption="Flash is powered down when the device is in Sleep mode" name="OFF" value="0x1" />
      </value-group>
      <value-group caption="Debug Mode CPU Access Permission" name="DEVCFG0__DBGPER">
         <value caption="Allow CPU access to Permission Group 2 permission regions" name="ALLOW_PG2" value="0x4" />
         <value caption="Allow CPU access to Permission Group 1 permission regions" name="ALLOW_PG1" value="0x2" />
         <value caption="Allow CPU access to Permission Group 0 permission regions" name="ALLOW_PG0" value="0x1" />
         <value caption="PG0: Allow PG1: Allow PG2: Deny" name="PG_1_0" value="0x3" />
         <value caption="PG0: Allow PG1: Deny PG2: Allow" name="PG_2_0" value="0x5" />
         <value caption="PG0: Deny PG1: Allow PG2: Allow" name="PG_2_1" value="0x6" />
         <value caption="Allow CPU access to all permission regions" name="PG_ALL" value="0x7" />
         <value caption="Deny CPU access to all permission regions" name="PG_NONE" value="0x0" />
      </value-group>
      <value-group caption="Soft Master Clear Enable bit" name="DEVCFG0__SMCLR">
         <value caption="MCLR pin generates a POR Reset" name="MCLR_POR" value="0x0" />
         <value caption="MCLR pin generates a normal system Reset" name="MCLR_NORM" value="0x1" />
      </value-group>
      <value-group caption="Secondary Oscillator Gain Control bits" name="DEVCFG0__SOSCGAIN">
         <value caption="Gain is G3" name="G3" value="0x3" />
         <value caption="Gain is G2" name="G2" value="0x2" />
         <value caption="Gain is G1" name="G1" value="0x1" />
         <value caption="Gain is G0" name="G0" value="0x0" />
      </value-group>
