Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK100.atdf
      <value-group caption="Digital Comparator 1 &quot;Output True&quot; Event Status bit" name="ADCCMPCON1__DCMPED">
         <value caption="Digital Comparator 1 output true event has occurred (output of Comparator is 1)" name="" value="0x1" />
         <value caption="Digital Comparator 1 output is false (output of Comparator is 0)" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 1 Global Interrupt Enable bit" name="ADCCMPCON1__DCMPGIEN">
         <value caption="A Digital Comparator 1 interrupt is generated when the DCMPED status bit (ADCCMPxCON) is set" name="" value="0x1" />
         <value caption="A Digital Comparator 1 interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 1 Enable bit" name="ADCCMPCON1__ENDCMP">
         <value caption="Digital Comparator 1 is enabled" name="" value="0x1" />
         <value caption="Digital Comparator 1 is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 1 Analog Input Identification bits" name="ADCCMPCON1__AINID">
         <value caption="AN27" name="" value="0x1b" />
         <value caption="AN26" name="" value="0x1a" />
         <value caption="AN25" name="" value="0x19" />
         <value caption="AN24" name="" value="0x18" />
         <value caption="AN23" name="" value="0x17" />
         <value caption="AN22" name="" value="0x16" />
         <value caption="AN21" name="" value="0x15" />
         <value caption="AN20" name="" value="0x14" />
         <value caption="AN19" name="" value="0x13" />
         <value caption="AN18" name="" value="0x12" />
         <value caption="AN17" name="" value="0x11" />
         <value caption="AN16" name="" value="0x10" />
         <value caption="AN15" name="" value="0xf" />
         <value caption="AN14" name="" value="0xe" />
         <value caption="AN13" name="" value="0xd" />
         <value caption="AN12" name="" value="0xc" />
         <value caption="AN11" name="" value="0xb" />
         <value caption="AN10" name="" value="0xa" />
         <value caption="AN9" name="" value="0x9" />
         <value caption="AN8" name="" value="0x8" />
         <value caption="AN7" name="" value="0x7" />
         <value caption="AN6" name="" value="0x6" />
         <value caption="AN5" name="" value="0x5" />
         <value caption="AN4" name="" value="0x4" />
         <value caption="AN3" name="" value="0x3" />
         <value caption="AN2" name="" value="0x2" />
         <value caption="AN1" name="" value="0x1" />
         <value caption="AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/Low Digital Comparator 2 Event bit" name="ADCCMPCON2__IELOLO">
         <value caption="Generate a Digital Comparator 2 Event when the DATA bits less than DCMPLO(15:0) bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/High Digital Comparator 2 Event bit" name="ADCCMPCON2__IELOHI">
         <value caption="Generate a Digital Comparator 2 Event when the DCMPLO bits less than DATA(31:0) bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low Digital Comparator 2 Event bit" name="ADCCMPCON2__IEHILO">
         <value caption="Generate a Digital Comparator 2 Event when the DATA bits less than DCMPHI(15:0) bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="High/High Digital Comparator 2 Event bit" name="ADCCMPCON2__IEHIHI">
         <value caption="Generate a Digital Comparator 2 Event when the DCMPHI bits less than or equal to DATA(31:0) bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Between Low/High Digital Comparator 2 Event bit" name="ADCCMPCON2__IEBTWN">
         <value caption="Generate a digital comparator event when the DCMPLO bits less than DATA bits less than DCMPHI bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 2 &quot;Output True&quot; Event Status bit" name="ADCCMPCON2__DCMPED">
         <value caption="Digital Comparator 2 output true event has occurred (output of Comparator is 1)" name="" value="0x1" />
         <value caption="Digital Comparator 2 output is false (output of Comparator is 0)" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 2 Global Interrupt Enable bit" name="ADCCMPCON2__DCMPGIEN">
         <value caption="A Digital Comparator 2 interrupt is generated when the DCMPED status bit (ADCCMPxCON) is set" name="" value="0x1" />
         <value caption="A Digital Comparator 2 interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 2 Enable bit" name="ADCCMPCON2__ENDCMP">
         <value caption="Digital Comparator 2 is enabled" name="" value="0x1" />
         <value caption="Digital Comparator 2 is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 2 Analog Input Identification bits" name="ADCCMPCON2__AINID">
         <value caption="AN27" name="" value="0x1b" />
         <value caption="AN26" name="" value="0x1a" />
         <value caption="AN25" name="" value="0x19" />
         <value caption="AN24" name="" value="0x18" />
         <value caption="AN23" name="" value="0x17" />
         <value caption="AN22" name="" value="0x16" />
         <value caption="AN21" name="" value="0x15" />
         <value caption="AN20" name="" value="0x14" />
         <value caption="AN19" name="" value="0x13" />
         <value caption="AN18" name="" value="0x12" />
         <value caption="AN17" name="" value="0x11" />
         <value caption="AN16" name="" value="0x10" />
         <value caption="AN15" name="" value="0xf" />
         <value caption="AN14" name="" value="0xe" />
         <value caption="AN13" name="" value="0xd" />
         <value caption="AN12" name="" value="0xc" />
         <value caption="AN11" name="" value="0xb" />
         <value caption="AN10" name="" value="0xa" />
         <value caption="AN9" name="" value="0x9" />
         <value caption="AN8" name="" value="0x8" />
         <value caption="AN7" name="" value="0x7" />
         <value caption="AN6" name="" value="0x6" />
         <value caption="AN5" name="" value="0x5" />
         <value caption="AN4" name="" value="0x4" />
         <value caption="AN3" name="" value="0x3" />
         <value caption="AN2" name="" value="0x2" />
         <value caption="AN1" name="" value="0x1" />
         <value caption="AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/Low Digital Comparator 3 Event bit" name="ADCCMPCON3__IELOLO">
         <value caption="Generate a Digital Comparator 3 Event when the DATA bits less than DCMPLO(15:0) bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/High Digital Comparator 3 Event bit" name="ADCCMPCON3__IELOHI">
         <value caption="Generate a Digital Comparator 3 Event when the DCMPLO bits less than DATA(31:0) bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
