Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK100.atdf
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT2__EIRDY53">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS&lt;2:0&gt; bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Analog and Bias Circuitry Enable bits" name="ADCANCON__ANEN0">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled the ADC module needs a warm-up time as defined by the WKUPCLKCNT bits." name="" value="0x1" />
         <value caption="Analog and bias circuitry disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Analog and Bias Circuitry Enable bits" name="ADCANCON__ANEN1">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled the ADC module needs a warm-up time as defined by the WKUPCLKCNT bits." name="" value="0x1" />
         <value caption="Analog and bias circuitry disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Analog and Bias Circuitry Enable bits" name="ADCANCON__ANEN2">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled the ADC module needs a warm-up time as defined by the WKUPCLKCNT bits." name="" value="0x1" />
         <value caption="Analog and bias circuitry disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Analog and Bias Circuitry Enable bits" name="ADCANCON__ANEN3">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled the ADC module needs a warm-up time as defined by the WKUPCLKCNT bits." name="" value="0x1" />
         <value caption="Analog and bias circuitry disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Analog and Bias Circuitry Enable bits" name="ADCANCON__ANEN4">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled the ADC module needs a warm-up time as defined by the WKUPCLKCNT bits." name="" value="0x1" />
         <value caption="Analog and bias circuitry disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Analog and Bias Circuitry Enable bits" name="ADCANCON__ANEN5">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled the ADC module needs a warm-up time as defined by the WKUPCLKCNT bits." name="" value="0x1" />
         <value caption="Analog and bias circuitry disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Analog and Bias Circuitry Enable bit" name="ADCANCON__ANEN7">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled the ADC module needs a warm-up time as defined by the WKUPCLKCNT bits." name="" value="0x1" />
         <value caption="Analog and bias circuitry disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC5-ADC0 Wake-up Status bit" name="ADCANCON__WKRDY0">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC5-ADC0 Wake-up Status bit" name="ADCANCON__WKRDY1">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC5-ADC0 Wake-up Status bit" name="ADCANCON__WKRDY2">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC5-ADC0 Wake-up Status bit" name="ADCANCON__WKRDY3">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC5-ADC0 Wake-up Status bit" name="ADCANCON__WKRDY4">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC5-ADC0 Wake-up Status bit" name="ADCANCON__WKRDY5">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Wake-up Status bit" name="ADCANCON__WKRDY7">
         <value caption="ADC7 Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANEN7 to 1" name="" value="0x1" />
         <value caption="ADC7 Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN0">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN1">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
