Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK100.atdf
      <value-group caption="Op amp/Comparator 3 Output Status bit" name="CMSTAT__C3OUT">
         <value caption="(When CPOL is 0) Vin+ &gt; Vth+ / (When CPOL is 1) VIN+  Vth+ / (When CPOL is 1) VIN+ &lt; VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) Vin+  Vth+" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp/Comparator 4 Output Status bit" name="CMSTAT__C4OUT">
         <value caption="(When CPOL is 0) Vin+ &gt; Vth+ / (When CPOL is 1) VIN+  Vth+ / (When CPOL is 1) VIN+ &lt; VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) Vin+  Vth+" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp/Comparator 5 Output Status bit" name="CMSTAT__C5OUT">
         <value caption="(When CPOL is 0) Vin+ &gt; Vth+ / (When CPOL is 1) VIN+  Vth+ / (When CPOL is 1) VIN+ &lt; VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) Vin+  Vth+" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="CMSTAT__SIDL">
         <value caption="Discontinue operation of all Op amp/Comparators when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator 1 Event Status bit" name="CMSTAT__C1EVT">
         <value caption="Comparator event according to EVPOL settings occurred. Future events/triggers and interrupts are disabled until the CEVT bit (CMxCON) is cleared by user software." name="" value="0x1" />
         <value caption="Comparator event did not occur" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator 2 Event Status bit" name="CMSTAT__C2EVT">
         <value caption="Comparator event according to EVPOL settings occurred. Future events/triggers and interrupts are disabled until the CEVT bit (CMxCON) is cleared by user software." name="" value="0x1" />
         <value caption="Comparator event did not occur" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator 3 Event Status bit" name="CMSTAT__C3EVT">
         <value caption="Comparator event according to EVPOL settings occurred. Future events/triggers and interrupts are disabled until the CEVT bit (CMxCON) is cleared by user software." name="" value="0x1" />
         <value caption="Comparator event did not occur" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator 4 Event Status bit" name="CMSTAT__C4EVT">
         <value caption="Comparator event according to EVPOL settings occurred. Future events/triggers and interrupts are disabled until the CEVT bit (CMxCON) is cleared by user software." name="" value="0x1" />
         <value caption="Comparator event did not occur" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator 5 Event Status bit" name="CMSTAT__C5EVT">
         <value caption="Comparator event according to EVPOL settings occurred. Future events/triggers and interrupts are disabled until the CEVT bit (CMxCON) is cleared by user software." name="" value="0x1" />
         <value caption="Comparator event did not occur" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Channel Select bits" name="CM1CON__CCH">
         <value caption="CxIN4-" name="" value="0x3" />
         <value caption="CxIN3-" name="" value="0x2" />
         <value caption="CxIN2-" name="" value="0x1" />
         <value caption="CxIN1-" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp/Comparator Reference Select bit" name="CM1CON__CREF">
         <value caption="VIN+ input connects to internal CDAC3 output voltage" name="" value="0x1" />
         <value caption="VIN+ input connects to CxIN1+ pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger/Event Polarity Select bits" name="CM1CON__EVPOL">
         <value caption="Trigger/Event generated on any change of the comparator output" name="" value="0x3" />
         <value caption="(When CPOL is 0) Trigger/Event generated only on high-to-low transition of the polarity-selected comparator output / (When CPOL is 1) Trigger/Event generated only on low-to-high transition of the polarity-selected comparator output" name="" value="0x2" />
         <value caption="(When CPOL is 0) Trigger/Event generated only on low-to-high transition of the polarity-selected comparator output / (When CPOL is 1) Trigger/Event generated only on high-to-low transition of the polarity-selected comparator output" name="" value="0x1" />
         <value caption="Trigger/Event generation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CM1CON__COUT">
         <value caption="(When CPOL is 0) VIN+ &gt; VTH+ / (When CPOL is 1) VIN+  VTH+ / (When CPOL is 1) VIN+ &lt; VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) VIN+  VTH-" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Event bit" name="CM1CON__CEVT">
         <value caption="Comparator event according to EVPOL bit settings occurred" name="" value="0x1" />
         <value caption="Comparator event did not occur" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Low-Power Mode Select bit" name="CM1CON__CLPWR">
         <value caption="Comparator operates in Low-Power mode" name="" value="0x1" />
         <value caption="Comparator does not operate in Low-Power mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Polarity Select bit" name="CM1CON__CPOL">
         <value caption="Comparator output is inverted" name="" value="0x1" />
         <value caption="Comparator output is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Enable bit" name="CM1CON__COE">
         <value caption="Comparator output is present on the CxOUT pin" name="" value="0x1" />
         <value caption="Comparator output is internal only" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Enable bit" name="CM1CON__ON">
         <value caption="Comparator is enabled" name="" value="0x1" />
         <value caption="Comparator is disabled" name="" value="0x0" />
      </value-group>
