Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK100.atdf
      <value-group caption="Comparator Output Digital Filter Enable bit" name="CM5CON__CFLTREN">
         <value caption="Digital Filters enabled" name="" value="0x1" />
         <value caption="Digital Filters disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Filter Clock Source Select bits" name="CM5CON__CFSEL">
         <value caption="PBCLK2/Timer5 Period Value (PR5)" name="" value="0x7" />
         <value caption="PBCLK2/Timer4 Period Value (PR4)" name="" value="0x6" />
         <value caption="PBCLK2/Timer3 Period Value (PR3)" name="" value="0x5" />
         <value caption="PBCLK2/Timer2 Period Value (PR2)" name="" value="0x4" />
         <value caption="REFCLK3 Clock" name="" value="0x3" />
         <value caption="PWM Secondary Special Event" name="" value="0x2" />
         <value caption="PPBCLK2 Clock" name="" value="0x1" />
         <value caption="SYSCLK Clock" name="" value="0x0" />
      </value-group>
      <value-group caption="Hysteresis Selection bits" name="CM5CON__HYSSEL">
         <value caption="Set highest hysteresis level (Typical 45 mV)" name="" value="0x3" />
         <value caption="Set medium hysteresis level (Typical 30 mV)" name="" value="0x2" />
         <value caption="Set lowest hysteresis level (Typical 15 mV)" name="" value="0x1" />
         <value caption="No hysteresis selected." name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp Fixed Gain Enable bit" name="CM5CON__ENPGA">
         <value caption="Op amp is operating in Fixed Gain 1X mode" name="" value="0x1" />
         <value caption="Op amp is operating in Open Loop mode (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp Enable bit" name="CM5CON__OPAON">
         <value caption="Op amp enabled and connected to pin" name="" value="0x1" />
         <value caption="Op amp disabled and pin is released to other functions" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate A Inverted Input Enable bit" name="CM1MSKCON__AANEN">
         <value caption="A input (inverted) enabled as input to AND gate" name="" value="0x1" />
         <value caption="A input (inverted) disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate A Input Enable bit" name="CM1MSKCON__AAEN">
         <value caption="A input enabled as input to AND gate" name="" value="0x1" />
         <value caption="A input disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate B Inverted Input Enable bit" name="CM1MSKCON__ABNEN">
         <value caption="B input (inverted) enabled as input to AND gate" name="" value="0x1" />
         <value caption="B input (inverted) disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate B Input Enable bit" name="CM1MSKCON__ABEN">
         <value caption="B input enabled as input to AND gate" name="" value="0x1" />
         <value caption="B input disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate C Inverted Input Enable bit" name="CM1MSKCON__ACNEN">
         <value caption="C input (inverted) enabled as input to AND gate" name="" value="0x1" />
         <value caption="C input (inverted) disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate C Input Enable bit" name="CM1MSKCON__ACEN">
         <value caption="C input enabled as input to AND gate" name="" value="0x1" />
         <value caption="C input disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="Positive AND Gate Output Select bit" name="CM1MSKCON__PAGS">
         <value caption="The positive output of the AND gate to the OR gate is enabled" name="" value="0x1" />
         <value caption="The positive output of the AND gate to the OR gate is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Negative AND Gate Output Select bit" name="CM1MSKCON__NAGS">
         <value caption="The negative (inverted) output of the AND gate to the OR gate is enabled" name="" value="0x1" />
         <value caption="The negative (inverted) output of the AND gate to the OR gate is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate A Input Inverted Enable bit" name="CM1MSKCON__OANEN">
         <value caption="A input (inverted) enabled as input to OR gate" name="" value="0x1" />
         <value caption="A input (inverted) disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate A Input Enable bit" name="CM1MSKCON__OAEN">
         <value caption="A input enabled as input to OR gate" name="" value="0x1" />
         <value caption="A input disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate B Input Inverted Enable bit" name="CM1MSKCON__OBNEN">
         <value caption="B input (inverted) enabled as input to OR gate" name="" value="0x1" />
         <value caption="B input (inverted) disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate B Input Enable bit" name="CM1MSKCON__OBEN">
         <value caption="B input enabled as input to OR gate" name="" value="0x1" />
         <value caption="B input disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate C Input Inverted Enable bit" name="CM1MSKCON__OCNEN">
         <value caption="C input (inverted) enabled as input to OR gate" name="" value="0x1" />
         <value caption="C input (inverted) disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate C Input Enable bit" name="CM1MSKCON__OCEN">
         <value caption="C input enabled as input to OR gate" name="" value="0x1" />
         <value caption="C input disabled as input to OR gate" name="" value="0x0" />
      </value-group>
