Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK100.atdf
      <value-group caption="Deep Sleep Enable bit" name="DSCON__DSEN">
         <value caption="Deep Sleep mode is entered on a WAIT command" name="" value="0x1" />
         <value caption="Sleep mode is entered on a WAIT command" name="" value="0x0" />
      </value-group>
      <value-group caption="MCLR Event bit" name="DSWAKE__DSMCLR">
         <value caption="The MCLR pin was active and was asserted during Deep Sleep" name="" value="0x1" />
         <value caption="The MCLR pin was not active, or was active, but not asserted during Deep Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Real-Time Clock and Calendar Alarm bit" name="DSWAKE__DSRTC">
         <value caption="The Real-Time Clock and Calendar triggered an alarm during Deep Sleep" name="" value="0x1" />
         <value caption="The Real-Time Clock and Calendar did not trigger an alarm during Deep Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Time-out bit" name="DSWAKE__DSWDT">
         <value caption="The Deep Sleep Watchdog Timer timed out during Deep Sleep" name="" value="0x1" />
         <value caption="The Deep Sleep Watchdog Timer did not time-out during Deep Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Deep Sleep Fault Detected bit" name="DSWAKE__DSFLT">
         <value caption="A Fault occurred during Deep Sleep and some Deep Sleep configuration settings may have been corrupted" name="" value="0x1" />
         <value caption="No Fault was detected during Deep Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt-on-Change bit" name="DSWAKE__DSINT0">
         <value caption="Interrupt-on-change was asserted during Deep Sleep" name="" value="0x1" />
         <value caption="Interrupt-on-change was not asserted during Deep Sleep" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02819" name="EEPROM" version="1">
      <register-group name="EEPROM">
         <register caption="EEPROM Control Register" name="EECON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Data EEPROM Command Selection bits" mask="0x00000007" name="CMD" values="EECON__CMD" />
            <bitfield caption="Data EEPROM Imminent Long Write Status bit" mask="0x00000008" name="ILW" values="EECON__ILW" />
            <bitfield caption="Data EEPROM Sequence Error Status bits" mask="0x00000030" name="ERR" values="EECON__ERR" />
            <bitfield caption="Data EEPROM Write Enable Control bit" mask="0x00000040" name="WREN" values="EECON__WREN" />
            <bitfield caption="Start Command Execution Control bit" mask="0x00000080" name="RW" values="EECON__RW" />
            <bitfield caption="Data EEPROM Abort Operation Control bit" mask="0x00001000" name="ABORT" values="EECON__ABORT" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="EECON__SIDL" />
            <bitfield caption="Data EEPROM Ready bit" mask="0x00004000" name="RDY" values="EECON__RDY" />
            <bitfield caption="Data EEPROM Power Control bit" mask="0x00008000" name="ON" values="EECON__ON" />
         </register>
         <register caption="" name="EEKEY" offset="0x10" rw="W" size="4">
            <bitfield mask="0x0000FFFF" name="EEKEY" />
         </register>
         <register caption="" name="EEADDR" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="EEADDR" />
         </register>
         <register caption="" name="EEDATA" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="EEDATA" />
         </register>
      </register-group>
      <value-group caption="Data EEPROM Command Selection bits" name="EECON__CMD">
         <value caption="Configuration register Write command (WREN bit must be set)" name="" value="0x4" />
         <value caption="Data EEPROM memory Bulk Erase command (WREN bit must be set)" name="" value="0x3" />
         <value caption="Data EEPROM memory Page Erase command (WREN bit must be set)" name="" value="0x2" />
         <value caption="Word Write command (WREN bit must be set)" name="" value="0x1" />
         <value caption="Word Read command (WREN bit must be clear)" name="" value="0x0" />
      </value-group>
      <value-group caption="Data EEPROM Imminent Long Write Status bit" name="EECON__ILW">
         <value caption="The next write to the EEPROM address (held in the EEADDR register) will require more time (~ 20 ms) than usual" name="" value="0x1" />
         <value caption="The next write to the EEPROM address (held in the EEADDR register) will be a normal write cycle" name="" value="0x0" />
      </value-group>
      <value-group caption="Data EEPROM Sequence Error Status bits" name="EECON__ERR">
         <value caption="A BOR event has occurred" name="" value="0x3" />
         <value caption="An attempted execution of a read or write operation with an invalid write OR command with a misaligned address" name="" value="0x2" />
         <value caption="A Bulk or Page Erase or a Word Program verify error has occurred" name="" value="0x1" />
         <value caption="No error condition" name="" value="0x0" />
      </value-group>
      <value-group caption="Data EEPROM Write Enable Control bit" name="EECON__WREN">
         <value caption="Enables program or erase operations" name="" value="0x1" />
         <value caption="Disables program or erase of memory elements, and enables read operations" name="" value="0x0" />
      </value-group>
      <value-group caption="Start Command Execution Control bit" name="EECON__RW">
         <value caption="(When WREN is 1)Start memory word program or erase command / (When WREN is 0)Start memory word read command" name="" value="0x1" />
         <value caption="(When WREN is 1)Cleared by hardware to indicate program or erase operation has completed / (When WREN is 0)Cleared by hardware to indicate read operation has completed" name="" value="0x0" />
      </value-group>
      <value-group caption="Data EEPROM Abort Operation Control bit" name="EECON__ABORT">
         <value caption="Set by software to abort the on-going write command as soon as possible" name="" value="0x1" />
         <value caption="Data EEPROM panel is ready/Normal operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="EECON__SIDL">
         <value caption="Discontinue operation when CPU enters in Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Data EEPROM Ready bit" name="EECON__RDY">
         <value caption="Data EEPROM is ready for access" name="" value="0x1" />
         <value caption="Data EEPROM is not ready for access" name="" value="0x0" />
      </value-group>
