Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK100.atdf
         <register caption="Input Capture x Control Register" name="IC14CON" offset="0x3A00" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC14CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC14CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC14CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC14CON__ICI" />
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC14CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC14CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC14CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC14CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC14CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC15CON" offset="0x3C00" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC15CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC15CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC15CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC15CON__ICI" />
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC15CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC15CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC15CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC15CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC15CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC16CON" offset="0x3E00" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC16CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC16CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC16CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC16CON__ICI" />
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC16CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC16CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC16CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC16CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC16CON__ON" />
         </register>
         <register caption="" name="IC1BUF" offset="0x2010" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC1BUF" />
         </register>
         <register caption="" name="IC2BUF" offset="0x2210" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC2BUF" />
         </register>
         <register caption="" name="IC3BUF" offset="0x2410" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC3BUF" />
         </register>
         <register caption="" name="IC4BUF" offset="0x2610" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC4BUF" />
         </register>
         <register caption="" name="IC5BUF" offset="0x2810" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC5BUF" />
         </register>
         <register caption="" name="IC6BUF" offset="0x2A10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC6BUF" />
         </register>
         <register caption="" name="IC7BUF" offset="0x2C10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC7BUF" />
         </register>
         <register caption="" name="IC8BUF" offset="0x2E10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC8BUF" />
         </register>
         <register caption="" name="IC9BUF" offset="0x3010" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC9BUF" />
         </register>
         <register caption="" name="IC10BUF" offset="0x3210" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC10BUF" />
         </register>
         <register caption="" name="IC11BUF" offset="0x3410" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC11BUF" />
         </register>
         <register caption="" name="IC12BUF" offset="0x3610" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC12BUF" />
         </register>
         <register caption="" name="IC13BUF" offset="0x3810" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC13BUF" />
         </register>
         <register caption="" name="IC14BUF" offset="0x3A10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC14BUF" />
         </register>
         <register caption="" name="IC15BUF" offset="0x3C10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC15BUF" />
         </register>
         <register caption="" name="IC16BUF" offset="0x3E10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC16BUF" />
         </register>
      </register-group>
