Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK100.atdf
      <value-group caption="Output Compare Timer Select bit(2)" name="OC16CON__OCTSEL">
         <value caption="Timery is the clock source for this Output Compare module" name="" value="0x1" />
         <value caption="Timerx is the clock source for this Output Compare module" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Fault Condition Status bit(1)" name="OC16CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1" />
         <value caption="No PWM Fault condition has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC16CON__OC32">
         <value caption="OCxR and/or OCxRS are used for comparisions to the 32-bit timer source" name="" value="0x1" />
         <value caption="OCxR and OCxRS are used for comparisons to the 16-bit timer source" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC16CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC16CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1" />
         <value caption="Output Compare peripheral is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="03088" name="PCACHE" version="">
      <register-group name="PCACHE">
         <register caption="Cache Module Control Register" name="CHECON" offset="0x0" rw="RW" size="4">
            <bitfield caption="PFM Access Time Defined in Terms of SYSCLK Wait States bits" mask="0x0000000F" name="PFMWS" values="CHECON__PFMWS" />
            <bitfield caption="Predictive Prefetch Enable bits" mask="0x00000030" name="PREFEN" values="CHECON__PREFEN" />
            <bitfield caption="PFM Address Wait State Enable bit" mask="0x00000100" name="PFMAWSEN" values="CHECON__PFMAWSEN" />
            <bitfield caption="Cache Performance Counters Enable bit" mask="0x00001000" name="CHEPERFEN" values="CHECON__CHEPERFEN" />
            <bitfield caption="Instruction Auto-cache Coherency Control bit" mask="0x00010000" name="ICHECOH" values="CHECON__ICHECOH" />
            <bitfield caption="Data Auto-cache Coherency Control bit" mask="0x00020000" name="DCHECOH" values="CHECON__DCHECOH" />
            <bitfield caption="Peripheral Auto-cache Coherency Control bit" mask="0x00040000" name="PERCHECOH" values="CHECON__PERCHECOH" />
            <bitfield caption="Instruction Cache Invalidate bit" mask="0x00100000" name="ICHEINV" values="CHECON__ICHEINV" />
            <bitfield caption="Data Cache Invalidate bit" mask="0x00200000" name="DCHEINV" values="CHECON__DCHEINV" />
            <bitfield caption="Peripheral Cache Invalidate bit" mask="0x00400000" name="PERCHEINV" values="CHECON__PERCHEINV" />
            <bitfield caption="Instruction Cache Enable bit" mask="0x01000000" name="ICHEEN" values="CHECON__ICHEEN" />
            <bitfield caption="Data Cache Enable bit" mask="0x02000000" name="DCHEEN" values="CHECON__DCHEEN" />
            <bitfield caption="Peripheral Cache Enable bit" mask="0x04000000" name="PERCHEEN" values="CHECON__PERCHEEN" />
         </register>
         <register caption="" name="CHESTAT" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="PFMSECCNT" />
            <bitfield mask="0x04000000" name="PFMSEC" />
            <bitfield mask="0x08000000" name="PFMDED" />
         </register>
         <register caption="CACHE Hit Status Register" name="CHEHIT" offset="0x20" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEHIT" />
         </register>
         <register caption="CACHE Miss Status Register" name="CHEMIS" offset="0x30" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEMIS" />
         </register>
      </register-group>
      <value-group caption="PFM Access Time Defined in Terms of SYSCLK Wait States bits" name="CHECON__PFMWS">
         <value caption="Seven Wait states" name="" value="0x7" />
         <value caption="Six Wait states" name="" value="0x6" />
         <value caption="Five Wait states" name="" value="0x5" />
         <value caption="Four Wait states" name="" value="0x4" />
         <value caption="Three Wait states" name="" value="0x3" />
         <value caption="Two Wait states" name="" value="0x2" />
         <value caption="One Wait state" name="" value="0x1" />
         <value caption="Zero Wait states" name="" value="0x0" />
      </value-group>
      <value-group caption="Predictive Prefetch Enable bits" name="CHECON__PREFEN">
         <value caption="Enable predictive prefetch for CPU instructions only" name="" value="0x1" />
         <value caption="Disable predictive prefetch" name="" value="0x0" />
      </value-group>
      <value-group caption="PFM Address Wait State Enable bit" name="CHECON__PFMAWSEN">
         <value caption="Add one more Wait State to flash address setup (suggested for higher system clock frequencies)" name="" value="0x1" />
         <value caption="Add no Wait States to the flash address setup (suggested for lower system clock frequencies to achieve higher performance)" name="" value="0x0" />
      </value-group>
      <value-group caption="Cache Performance Counters Enable bit" name="CHECON__CHEPERFEN">
         <value caption="Performance counters are enabled" name="" value="0x1" />
         <value caption="Performance counters are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Instruction Auto-cache Coherency Control bit" name="CHECON__ICHECOH">
         <value caption="Automatically invalidate cache on a programming event" name="" value="0x1" />
         <value caption="Do not automatically invalidate cache on a programming event" name="" value="0x0" />
      </value-group>
