Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK100.atdf
         <register caption="" name="SBT1WR6" offset="0x8008" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1WR6__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1WR6__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1WR6__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1WR6__GROUP3" />
         </register>
         <register caption="" name="SBT1WR7" offset="0x8028" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1WR7__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1WR7__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1WR7__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1WR7__GROUP3" />
         </register>
         <register caption="" name="SBT1WR8" offset="0x8048" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1WR8__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1WR8__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1WR8__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1WR8__GROUP3" />
         </register>
         <register caption="" name="SBT2WR0" offset="0x8348" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT2WR0__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT2WR0__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT2WR0__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT2WR0__GROUP3" />
         </register>
         <register caption="" name="SBT2WR1" offset="0x8368" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT2WR1__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT2WR1__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT2WR1__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT2WR1__GROUP3" />
         </register>
         <register caption="" name="SBT2WR2" offset="0x8388" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT2WR2__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT2WR2__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT2WR2__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT2WR2__GROUP3" />
         </register>
         <register caption="" name="SBT3WR0" offset="0x8748" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT3WR0__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT3WR0__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT3WR0__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT3WR0__GROUP3" />
         </register>
         <register caption="" name="SBT3WR1" offset="0x8768" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT3WR1__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT3WR1__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT3WR1__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT3WR1__GROUP3" />
         </register>
         <register caption="" name="SBT3WR2" offset="0x8788" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT3WR2__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT3WR2__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT3WR2__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT3WR2__GROUP3" />
         </register>
      </register-group>
      <value-group caption="Target 0 Permission Group Violation Status bits" name="SBFLAG__T0PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Target 1Permission Group Violation Status bits" name="SBFLAG__T1PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Target 2 Permission Group Violation Status bits" name="SBFLAG__T2PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Target 3 Permission Group Violation Status bits" name="SBFLAG__T3PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Transaction Command of the Requester bits" name="SBT0ELOG1__CMD">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Write (a non-posted write)" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Read (a locked read caused by a Read-Modify-Write transaction)" name="" value="0x3" />
         <value caption="Read" name="" value="0x2" />
         <value caption="Write" name="" value="0x1" />
         <value caption="Idle" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Region Number bits" name="SBT0ELOG1__REGION">
         <value caption="Target region 15 reported a permission group violation" name="" value="0xf" />
         <value caption="Target region 14 reported a permission group violation" name="" value="0xe" />
         <value caption="Target region 13 reported a permission group violation" name="" value="0xd" />
         <value caption="Target region 12 reported a permission group violation" name="" value="0xc" />
         <value caption="Target region 11 reported a permission group violation" name="" value="0xb" />
         <value caption="Target region 10 reported a permission group violation" name="" value="0xa" />
         <value caption="Target region 9 reported a permission group violation" name="" value="0x9" />
         <value caption="Target region 8 reported a permission group violation" name="" value="0x8" />
         <value caption="Target region 7 reported a permission group violation" name="" value="0x7" />
         <value caption="Target region 6 reported a permission group violation" name="" value="0x6" />
         <value caption="Target region 5 reported a permission group violation" name="" value="0x5" />
         <value caption="Target region 4 reported a permission group violation" name="" value="0x4" />
         <value caption="Target region 3 reported a permission group violation" name="" value="0x3" />
         <value caption="Target region 2 reported a permission group violation" name="" value="0x2" />
         <value caption="Target region 1 reported a permission group violation" name="" value="0x1" />
         <value caption="Target region 0 reported a permission group violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Initiator ID of Requester bits" name="SBT0ELOG1__INITID">
         <value caption="Reserved" name="" value="0xff" />
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="CAN4" name="" value="0xd" />
         <value caption="CAN3" name="" value="0xc" />
         <value caption="CAN2" name="" value="0xb" />
         <value caption="CAN1" name="" value="0xa" />
         <value caption="USB2" name="" value="0x9" />
         <value caption="USB1" name="" value="0x8" />
         <value caption="ADC0-ADC5, ADC7" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Flash Controller" name="" value="0x5" />
         <value caption="DMA Read (DMAPRI (CFGCON) = 1)" name="" value="0x4" />
         <value caption="DMA Read (DMAPRI (CFGCON) = 0)" name="" value="0x3" />
         <value caption="CPU (CPUPRI (CFGCON) = 1)" name="" value="0x2" />
         <value caption="CPU (CPUPRI (CFGCON) = 0)" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Code bits" name="SBT0ELOG1__CODE">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Permission violation" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Reserved" name="" value="0x1" />
         <value caption="No error" name="" value="0x0" />
      </value-group>
      <value-group caption="Multiple Permission Violations Status bit" name="SBT0ELOG1__MULTI">
         <value caption="Multiple errors have been detected" name="" value="0x1" />
         <value caption="No multiple errors have been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Transaction Command of the Requester bits" name="SBT1ELOG1__CMD">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Write (a non-posted write)" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Read (a locked read caused by a Read-Modify-Write transaction)" name="" value="0x3" />
         <value caption="Read" name="" value="0x2" />
         <value caption="Write" name="" value="0x1" />
         <value caption="Idle" name="" value="0x0" />
      </value-group>
