Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK100.atdf
      <value-group caption="Receiver Idle bit (read-only)" name="U6STA__RIDLE">
         <value caption="Receiver is Idle" name="" value="0x1" />
         <value caption="Data is being received" name="" value="0x0" />
      </value-group>
      <value-group caption="Address Character Detect bit (bit 8 of received data = 1)" name="U6STA__ADDEN">
         <value caption="Address Detect mode is enabled. If 9-bit mode is not selected" name="" value="0x1" />
         <value caption="Address Detect mode is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Interrupt Mode Selection bit" name="U6STA__URXISEL">
         <value caption="Interrupt flag bit is asserted while receive buffer is 3/4 or more full" name="" value="0x2" />
         <value caption="Interrupt flag bit is asserted while receive buffer is 1/2 or more full" name="" value="0x1" />
         <value caption="Interrupt flag bit is asserted while receive buffer is not empty (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Shift Register is Empty bit (read-only)" name="U6STA__TRMT">
         <value caption="Transmit shift register is empty and transmit buffer is empty (the last transmission has completed)" name="" value="0x1" />
         <value caption="Transmit shift register is not empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Full Status bit (read-only)" name="U6STA__UTXBF">
         <value caption="Transmit buffer is full" name="" value="0x1" />
         <value caption="Transmit buffer is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Enable bit" name="U6STA__UTXEN">
         <value caption="UARTx transmitter is enabled. UxTX pin is controlled by UARTx (if ON = 1)" name="" value="0x1" />
         <value caption="UARTx transmitter is disabled. Any pending transmission is aborted and buffer is reset" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Break bit" name="U6STA__UTXBRK">
         <value caption="Send Break on next transmission. Start bit followed by twelve 0 bits" name="" value="0x1" />
         <value caption="Break transmission is disabled or completed" name="" value="0x0" />
      </value-group>
      <value-group caption="Receiver Enable bit" name="U6STA__URXEN">
         <value caption="UARTx receiver is enabled. UxRX pin is controlled by UARTx (if ON = 1)" name="" value="0x1" />
         <value caption="UARTx receiver is disabled. UxRX pin is ignored by the UARTx module" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Polarity Inversion bit" name="U6STA__UTXINV">
         <value caption="(If IrDA mode is disabled) UxTX Idle state is 0 / (If IrDA mode is enabled) IrDA encoded UxTX Idle state is 1" name="" value="0x1" />
         <value caption="(If IrDA mode is disabled) UxTX Idle state is 1 / (If IrDA mode is enabled) IrDA encoded UxTX Idle state is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="TX Interrupt Mode Selection bits" name="U6STA__UTXISEL">
         <value caption="Interrupt is generated and asserted while the transmit buffer is empty" name="" value="0x2" />
         <value caption="Interrupt is generated and asserted when all characters have been transmitted" name="" value="0x1" />
         <value caption="Interrupt is generated and asserted while the transmit buffer contains at least one empty space" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Address Match Mask bits" name="U6STA__MASK">
         <value caption="Corresponding ADDRx bits are used to detect the address match" name="" value="0x1fe" />
         <value caption="Corresponding ADDRx bits are not used to detect the address match." name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02813" name="USB" version="3">
      <register-group name="USB">
         <register caption="USB OTG Interrupt Status Register (x = 1 and 2)" name="U1OTGIR" offset="0x0" rw="RW" size="4">
            <bitfield caption="A-Device VBUS Change Indicator bit" mask="0x00000001" name="VBUSVDIF" values="U1OTGIR__VBUSVDIF" />
            <bitfield caption="B-Device VBUS Change Indicator bit" mask="0x00000004" name="SESENDIF" values="U1OTGIR__SESENDIF" />
            <bitfield caption="Session Valid Change Indicator bit" mask="0x00000008" name="SESVDIF" values="U1OTGIR__SESVDIF" />
            <bitfield caption="Bus Activity Indicator bit" mask="0x00000010" name="ACTVIF" values="U1OTGIR__ACTVIF" />
            <bitfield caption="Line State Stable Indicator bit" mask="0x00000020" name="LSTATEIF" values="U1OTGIR__LSTATEIF" />
            <bitfield caption="1 Millisecond Timer bit" mask="0x00000040" name="T1MSECIF" values="U1OTGIR__T1MSECIF" />
            <bitfield caption="ID State Change Indicator bit" mask="0x00000080" name="IDIF" values="U1OTGIR__IDIF" />
         </register>
         <register caption="USB OTG Interrupt Status Register (x = 1 and 2)" name="U2OTGIR" offset="0x1000" rw="RW" size="4">
            <bitfield caption="A-Device VBUS Change Indicator bit" mask="0x00000001" name="VBUSVDIF" values="U2OTGIR__VBUSVDIF" />
            <bitfield caption="B-Device VBUS Change Indicator bit" mask="0x00000004" name="SESENDIF" values="U2OTGIR__SESENDIF" />
            <bitfield caption="Session Valid Change Indicator bit" mask="0x00000008" name="SESVDIF" values="U2OTGIR__SESVDIF" />
            <bitfield caption="Bus Activity Indicator bit" mask="0x00000010" name="ACTVIF" values="U2OTGIR__ACTVIF" />
            <bitfield caption="Line State Stable Indicator bit" mask="0x00000020" name="LSTATEIF" values="U2OTGIR__LSTATEIF" />
            <bitfield caption="1 Millisecond Timer bit" mask="0x00000040" name="T1MSECIF" values="U2OTGIR__T1MSECIF" />
            <bitfield caption="ID State Change Indicator bit" mask="0x00000080" name="IDIF" values="U2OTGIR__IDIF" />
         </register>
         <register caption="USB OTG Interrupt Enable Register (x = 1 and 2)" name="U1OTGIE" offset="0x10" rw="RW" size="4">
            <bitfield caption="A- Vbus Valid Interrupt Enable bit" mask="0x00000001" name="VBUSVDIE" values="U1OTGIE__VBUSVDIE" />
            <bitfield caption="B-Session End Interrupt Enable bit" mask="0x00000004" name="SESENDIE" values="U1OTGIE__SESENDIE" />
            <bitfield caption="Session Valid Interrupt Enable bit" mask="0x00000008" name="SESVDIE" values="U1OTGIE__SESVDIE" />
            <bitfield caption="Bus Activity Interrupt Enable bit" mask="0x00000010" name="ACTVIE" values="U1OTGIE__ACTVIE" />
            <bitfield caption="Line State Interrupt Enable bit" mask="0x00000020" name="LSTATEIE" values="U1OTGIE__LSTATEIE" />
            <bitfield caption="1 Millisecond Timer Interrupt Enable bit" mask="0x00000040" name="T1MSECIE" values="U1OTGIE__T1MSECIE" />
            <bitfield caption="ID Interrupt Enable bit" mask="0x00000080" name="IDIE" values="U1OTGIE__IDIE" />
         </register>
