Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK100.atdf
      <value-group caption="DMA Error Flag bit" name="U2EIR__DMAEF">
         <value caption="USB DMA error condition detected" name="" value="0x1" />
         <value caption="No DMA error" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Matrix Error Flag bit" name="U2EIR__BMXEF">
         <value caption="The base address, of the BDT, or the address of an individual buffer pointed to by a BDT entry, is invalid" name="" value="0x1" />
         <value caption="No address error" name="" value="0x0" />
      </value-group>
      <value-group caption="Bit Stuff Error Flag bit" name="U2EIR__BTSEF">
         <value caption="Packet rejected due to bit stuff error" name="" value="0x1" />
         <value caption="Packet accepted" name="" value="0x0" />
      </value-group>
      <value-group caption="PID Check Failure Interrupt Enable bit" name="U1EIE__PIDEE">
         <value caption="PIDEF interrupt is enabled" name="" value="0x1" />
         <value caption="PIDEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="(Device mode) CRC5 Host Error Interrupt Enable bit / (Host mode) EOF Error Interrupt Enable bit" name="U1EIE__CRC5EE_EOFEE">
         <value caption="(Device mode)CRC5EF interrupt is enabled / (Host mode)EOF interrupt is enabled" name="" value="0x1" />
         <value caption="(Device mode)CRC5EF interrupt is disabled / (Host mode)EOF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC16 Failure Interrupt Enable bit" name="U1EIE__CRC16EE">
         <value caption="CRC16EF interrupt is enabled" name="" value="0x1" />
         <value caption="CRC16EF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Field Size Error Interrupt Enable bit" name="U1EIE__DFN8EE">
         <value caption="DFN8EF interrupt is enabled" name="" value="0x1" />
         <value caption="DFN8EF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Turnaround Time-out Error Interrupt Enable bit" name="U1EIE__BTOEE">
         <value caption="BTOEF interrupt is enabled" name="" value="0x1" />
         <value caption="BTOEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Error Interrupt Enable bit" name="U1EIE__DMAEE">
         <value caption="DMAEF interrupt is enabled" name="" value="0x1" />
         <value caption="DMAEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Matrix Error Interrupt Enable bit" name="U1EIE__BMXEE">
         <value caption="BMXEF interrupt is enabled" name="" value="0x1" />
         <value caption="BMXEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bit Stuff Error Interrupt Enable bit" name="U1EIE__BTSEE">
         <value caption="BTSEF interrupt is enabled" name="" value="0x1" />
         <value caption="BTSEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PID Check Failure Interrupt Enable bit" name="U2EIE__PIDEE">
         <value caption="PIDEF interrupt is enabled" name="" value="0x1" />
         <value caption="PIDEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="(Device mode) CRC5 Host Error Interrupt Enable bit / (Host mode) EOF Error Interrupt Enable bit" name="U2EIE__CRC5EE_EOFEE">
         <value caption="(Device mode)CRC5EF interrupt is enabled / (Host mode)EOF interrupt is enabled" name="" value="0x1" />
         <value caption="(Device mode)CRC5EF interrupt is disabled / (Host mode)EOF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC16 Failure Interrupt Enable bit" name="U2EIE__CRC16EE">
         <value caption="CRC16EF interrupt is enabled" name="" value="0x1" />
         <value caption="CRC16EF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Field Size Error Interrupt Enable bit" name="U2EIE__DFN8EE">
         <value caption="DFN8EF interrupt is enabled" name="" value="0x1" />
         <value caption="DFN8EF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Turnaround Time-out Error Interrupt Enable bit" name="U2EIE__BTOEE">
         <value caption="BTOEF interrupt is enabled" name="" value="0x1" />
         <value caption="BTOEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Error Interrupt Enable bit" name="U2EIE__DMAEE">
         <value caption="DMAEF interrupt is enabled" name="" value="0x1" />
         <value caption="DMAEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Matrix Error Interrupt Enable bit" name="U2EIE__BMXEE">
         <value caption="BMXEF interrupt is enabled" name="" value="0x1" />
         <value caption="BMXEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bit Stuff Error Interrupt Enable bit" name="U2EIE__BTSEE">
         <value caption="BTSEF interrupt is enabled" name="" value="0x1" />
         <value caption="BTSEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Ping-Pong BD Pointer Indicator bit" name="U1STAT__PPBI">
         <value caption="The last transaction was to the ODD BD bank" name="" value="0x1" />
         <value caption="The last transaction was to the EVEN BD bank" name="" value="0x0" />
      </value-group>
      <value-group caption="Last BD Direction Indicator bit" name="U1STAT__DIR">
         <value caption="Last transaction was a transmit transfer (TX)" name="" value="0x1" />
         <value caption="Last transaction was a receive transfer (RX)" name="" value="0x0" />
      </value-group>
      <value-group caption="Encoded Number of Last Endpoint Activity bits" name="U1STAT__ENDPT">
         <value caption="Endpoint 15" name="" value="0xf" />
         <value caption="Endpoint 14" name="" value="0xe" />
         <value caption="Endpoint 13" name="" value="0xd" />
         <value caption="Endpoint 12" name="" value="0xc" />
         <value caption="Endpoint 11" name="" value="0xb" />
         <value caption="Endpoint 10" name="" value="0xa" />
         <value caption="Endpoint 9" name="" value="0x9" />
         <value caption="Endpoint 8" name="" value="0x8" />
         <value caption="Endpoint 7" name="" value="0x7" />
         <value caption="Endpoint 6" name="" value="0x6" />
         <value caption="Endpoint 5" name="" value="0x5" />
         <value caption="Endpoint 4" name="" value="0x4" />
         <value caption="Endpoint 3" name="" value="0x3" />
         <value caption="Endpoint 2" name="" value="0x2" />
         <value caption="Endpoint 1" name="" value="0x1" />
         <value caption="Endpoint 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Ping-Pong BD Pointer Indicator bit" name="U2STAT__PPBI">
         <value caption="The last transaction was to the ODD BD bank" name="" value="0x1" />
         <value caption="The last transaction was to the EVEN BD bank" name="" value="0x0" />
      </value-group>
      <value-group caption="Last BD Direction Indicator bit" name="U2STAT__DIR">
         <value caption="Last transaction was a transmit transfer (TX)" name="" value="0x1" />
         <value caption="Last transaction was a receive transfer (RX)" name="" value="0x0" />
      </value-group>
      <value-group caption="Encoded Number of Last Endpoint Activity bits" name="U2STAT__ENDPT">
         <value caption="Endpoint 15" name="" value="0xf" />
         <value caption="Endpoint 14" name="" value="0xe" />
         <value caption="Endpoint 13" name="" value="0xd" />
         <value caption="Endpoint 12" name="" value="0xc" />
         <value caption="Endpoint 11" name="" value="0xb" />
         <value caption="Endpoint 10" name="" value="0xa" />
         <value caption="Endpoint 9" name="" value="0x9" />
         <value caption="Endpoint 8" name="" value="0x8" />
         <value caption="Endpoint 7" name="" value="0x7" />
         <value caption="Endpoint 6" name="" value="0x6" />
         <value caption="Endpoint 5" name="" value="0x5" />
         <value caption="Endpoint 4" name="" value="0x4" />
         <value caption="Endpoint 3" name="" value="0x3" />
         <value caption="Endpoint 2" name="" value="0x2" />
         <value caption="Endpoint 1" name="" value="0x1" />
         <value caption="Endpoint 0" name="" value="0x0" />
      </value-group>
      <value-group caption="(Device mode)USB Module Enable bit / (Host mode)" name="U1CON__USBEN_SOFEN">
         <value caption="(Device mode)USB module and supporting circuitry is enabled / (Host mode)SOF token sent every 1 ms" name="" value="0x1" />
         <value caption="(Device mode)USB module and supporting circuitry is disabled / (Host mode)SOF token disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Ping-Pong Buffers Reset bit" name="U1CON__PPBRST">
         <value caption="Reset all Even/Odd buffer pointers to the EVEN BD banks" name="" value="0x1" />
         <value caption="Even/Odd buffer pointers not being Reset" name="" value="0x0" />
      </value-group>
